espressif/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
// Copyright 2015-2026 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "USBAudioCard.h"
#if SOC_USB_OTG_SUPPORTED
#if CONFIG_TINYUSB_AUDIO_ENABLED

#include "esp32-hal-tinyusb.h"
#include "USBAudioCardDescriptors.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include <math.h>
#include <inttypes.h>

ESP_EVENT_DEFINE_BASE(ARDUINO_USB_AUDIO_CARD_EVENTS);
esp_err_t arduino_usb_event_post(esp_event_base_t event_base, int32_t event_id, void *event_data, size_t event_data_size, TickType_t ticks_to_wait);
esp_err_t arduino_usb_event_handler_register_with(esp_event_base_t event_base, int32_t event_id, esp_event_handler_t event_handler, void *event_handler_arg);

static uint8_t _itf_num = 0;
static uint32_t _sample_rate = 48000;
static uint8_t _spk_channels = 2;
static uint8_t _mic_channels = 2;
static uint8_t _bits_per_sample = 24;
static uint8_t _bytes_per_sample = 4;
static bool _mute[3] = {false, false, false};
static int16_t _volume[3] = {0, 0, 0};
//static int32_t *_mic_buf = NULL; //[CFG_TUD_AUDIO_FUNC_1_EP_IN_SW_BUF_SZ / 4]
static int32_t *_spk_buf = NULL;  //[CFG_TUD_AUDIO_FUNC_1_EP_OUT_SW_BUF_SZ / 4]
static arduino_usb_audio_card_data_handler_t _cb = NULL;
static USBAudioCard *_uac = NULL;

// The multi-rate state is opt-in via UAC_USE_MULTIPLE_RATES. The UAC1 descriptor
// builders that follow are additionally gated on !TUD_OPT_HIGH_SPEED because the
// high-speed (UAC2) path advertises rates through its clock source controls.
#if defined(UAC_USE_MULTIPLE_RATES)
static uint32_t _sample_rates[USBAudioCard::UAC_MAX_SAMPLE_RATES] = {48000};
static uint8_t _num_sample_rates = 1;
static uint32_t _max_sample_rate = 48000;

static bool _is_sample_rate_supported(uint32_t rate) {
  for (uint8_t i = 0; i < _num_sample_rates; i++) {
    if (_sample_rates[i] == rate) {
      return true;
    }
  }
  return false;
}
#endif

#if defined(UAC_USE_MULTIPLE_RATES) && !TUD_OPT_HIGH_SPEED

// UAC1 (full-speed) multi-rate descriptor builders.
//
// TUD_AUDIO10_DESC_TYPE_I_FORMAT derives the advertised sample-rate COUNT from
// the number of macro arguments (bSamFreqType = TU_ARGS_NUM(...)), so the count
// must be a compile-time value while the values stay runtime (_sample_rates[]).
// Each topology is therefore expanded once per admissible count via a switch on
// _num_sample_rates, using numeric literals (token-pasting does not expand
// identifiers, so templates on N cannot be used here).

#define _UAC10_FREQS_1(_r)   (_r)[0]
#define _UAC10_FREQS_2(_r)   (_r)[0], (_r)[1]
#define _UAC10_FREQS_3(_r)   (_r)[0], (_r)[1], (_r)[2]
#define _UAC10_FREQS_4(_r)   (_r)[0], (_r)[1], (_r)[2], (_r)[3]
#define _UAC10_FREQS_5(_r)   (_r)[0], (_r)[1], (_r)[2], (_r)[3], (_r)[4]
#define _UAC10_FREQS_6(_r)   (_r)[0], (_r)[1], (_r)[2], (_r)[3], (_r)[4], (_r)[5]
#define _UAC10_FREQS_7(_r)   (_r)[0], (_r)[1], (_r)[2], (_r)[3], (_r)[4], (_r)[5], (_r)[6]
#define _UAC10_FREQS_8(_r)   (_r)[0], (_r)[1], (_r)[2], (_r)[3], (_r)[4], (_r)[5], (_r)[6], (_r)[7]
#define _UAC10_FREQS(_n, _r) _UAC10_FREQS_##_n(_r)  // _n MUST be a numeric literal

#define _UAC10_CASES(_m) _m(1) _m(2) _m(3) _m(4) _m(5) _m(6) _m(7) _m(8)

// Keep the public cap in sync with the cases above. Lowering it is safe (the constructor rejects
// larger counts and the extra cases become dead code), but raising it would require additional
// cases in _UAC10_CASES and corresponding TinyUSB macro expansion support.
static_assert(USBAudioCard::UAC_MAX_SAMPLE_RATES <= 8, "UAC_MAX_SAMPLE_RATES must not exceed the 8 cases expanded by _UAC10_CASES (TinyUSB TU_ARGS_APPLY_EXPAND limit)");

#define _UAC10_CASE_HEADSET_STEREO(_n)                                                         \
  case _n: {                                                                                   \
    uint8_t descriptor[TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(_n)] = {                            \
TUD_AUDIO10_HEADSET_STEREO_DESCRIPTOR(                                                   \
      _itf_num, str_index, ep_num, (uint8_t)(ep_num | 0x80), _max_sample_rate, _spk_channels, \
_mic_channels, _bytes_per_sample, _bits_per_sample, _UAC10_FREQS(_n, _sample_rates)    \
      )                                                                                        \
    };                                                                                         \
    *itf += 3;                                                                                 \
    memcpy(dst, descriptor, sizeof(descriptor));                                               \
    return sizeof(descriptor);                                                                 \
  }

#define _UAC10_CASE_HEADSET_MONO(_n)                                                           \
  case _n: {                                                                                   \
    uint8_t descriptor[TUD_AUDIO10_HEADSET_MONO_DESC_LEN(_n)] = {                              \
TUD_AUDIO10_HEADSET_MONO_DESCRIPTOR(                                                     \
      _itf_num, str_index, ep_num, (uint8_t)(ep_num | 0x80), _max_sample_rate, _spk_channels, \
_mic_channels, _bytes_per_sample, _bits_per_sample, _UAC10_FREQS(_n, _sample_rates)    \
      )                                                                                        \
    };                                                                                         \
    *itf += 3;                                                                                 \
    memcpy(dst, descriptor, sizeof(descriptor));                                               \
    return sizeof(descriptor);                                                                 \
  }

