espressif/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
#if TUD_OPT_HIGH_SPEED
  if (entityID == UAC2_ENTITY_SPK_FEATURE_UNIT && p_request->bRequest == AUDIO20_CS_REQ_CUR) {
    if (ctrlSel == AUDIO20_FU_CTRL_MUTE) {
      TU_VERIFY(p_request->wLength == sizeof(audio20_control_cur_1_t));
      _mute[channelNum] = ((audio20_control_cur_1_t const *)buf)->bCur;
      log_d("Set channel %d Mute: %d", channelNum, _mute[channelNum]);
      // Send MUTE Event
      arduino_usb_audio_card_event_data_t p;
      p.mute.channel = (UAC_Channel)channelNum;
      p.mute.muted = _mute[channelNum];
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    } else if (ctrlSel == AUDIO20_FU_CTRL_VOLUME) {
      TU_VERIFY(p_request->wLength == sizeof(audio20_control_cur_2_t));
      _volume[channelNum] = ((audio20_control_cur_2_t const *)buf)->bCur;
      log_d("Set channel %d volume: %d dB", channelNum, _volume[channelNum] / 256);
      // Send Volume Event
      arduino_usb_audio_card_event_data_t p;
      p.volume.channel = (UAC_Channel)channelNum;
      p.volume.db = _volume[channelNum] / 256;
      arduino_usb_event_post(
        ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
      );
      return true;
    }
    log_w("Feature unit set request not supported, entityID = %u, ctrlSel = %u, bRequest = %u", entityID, ctrlSel, p_request->bRequest);
    return false;
  } else if (entityID == UAC2_ENTITY_CLOCK && p_request->bRequest == AUDIO20_CS_REQ_CUR) {
    if (ctrlSel == AUDIO20_CS_CTRL_SAM_FREQ) {
      TU_VERIFY(p_request->wLength == sizeof(audio20_control_cur_4_t));
      uint32_t rate = tu_le32toh((uint32_t)((audio20_control_cur_4_t const *)buf)->bCur);
#ifdef UAC_USE_MULTIPLE_RATES
      if (!_is_sample_rate_supported(rate)) {
        log_w("Sample rate %" PRIu32 " is not in the advertised list, rejecting", rate);
        return false;
      }
#endif
      _sample_rate = rate;
      log_d("Clock set current freq: %" PRIu32, _sample_rate);
      // Send SAMPLE RATE Event
      arduino_usb_audio_card_event_data_t p;
      p.sample_rate.rate = _sample_rate;
      arduino_usb_event_post(
        ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_SAMPLE_RATE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
      );
      return true;
    }
    log_w("Clock set request not supported, entityID = %u, ctrlSel = %u, bRequest = %u", entityID, ctrlSel, p_request->bRequest);
    return false;
  }
  log_w("Set request not handled, entityID = %d, ctrlSel = %d, bRequest = %d", entityID, ctrlSel, p_request->bRequest);
  return false;
#else
  if (entityID == UAC1_ENTITY_SPK_FEATURE_UNIT && p_request->bRequest == AUDIO10_CS_REQ_SET_CUR) {
    if (ctrlSel == AUDIO10_FU_CTRL_MUTE && p_request->wLength == 1) {
      _mute[channelNum] = buf[0];
      log_d("Set Mute: %d of channel: %u", _mute[channelNum], channelNum);
      // Send MUTE Event
      arduino_usb_audio_card_event_data_t p;
      p.mute.channel = (UAC_Channel)channelNum;
      p.mute.muted = _mute[channelNum];
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    } else if (ctrlSel == AUDIO10_FU_CTRL_VOLUME && p_request->wLength == 2) {
      _volume[channelNum] = (int16_t)tu_unaligned_read16(buf);
      log_d("Set Volume: %d dB of channel: %u", _volume[channelNum] / 256, channelNum);
      // Send Volume Event
      arduino_usb_audio_card_event_data_t p;
      p.volume.channel = (UAC_Channel)channelNum;
      p.volume.db = _volume[channelNum] / 256;
      arduino_usb_event_post(
        ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
      );
      return true;
    }
  }
  log_w("Set request not handled, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

bool tud_audio_set_itf_close_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  (void)rhport;
  dump_control_request(p_request);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
  uint8_t const itf = tu_u16_low(tu_le16toh(p_request->wIndex)) - _itf_num;
  uint8_t const alt = tu_u16_low(tu_le16toh(p_request->wValue));
  log_d("Close EP interface %d alt %d", itf, alt);
#endif
  return true;
}

bool tud_audio_set_itf_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  (void)rhport;
  dump_control_request(p_request);
  uint8_t const itf = tu_u16_low(tu_le16toh(p_request->wIndex)) - _itf_num;
  uint8_t const alt = tu_u16_low(tu_le16toh(p_request->wValue));
  log_d("Set interface %d alt %d", itf, alt);
  // Send Interface Event
  arduino_usb_audio_card_event_data_t p;
  if (_spk_channels > 0 && itf == 1) {
    p.interface_enable.interface = UAC_INTERFACE_SPK;
  } else if (_spk_channels == 0 && itf == 1) {
    p.interface_enable.interface = UAC_INTERFACE_MIC;
  } else {
    p.interface_enable.interface = UAC_INTERFACE_MIC;
  }
  p.interface_enable.enable = alt != 0;
  arduino_usb_event_post(
    ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_INTERFACE_ENABLE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY
  );
  return true;
}

#if defined(UAC_USE_MULTIPLE_RATES)
USBAudioCard::USBAudioCard(uint32_t sample_rate, UAC_Bits_Per_Sample bps, UAC_SPK_Channels spk_channels, UAC_MIC_Channels mic_channels)
  : USBAudioCard(&sample_rate, 1, bps, spk_channels, mic_channels) {}
USBAudioCard::USBAudioCard(const uint32_t *sample_rates, uint8_t num_rates, UAC_Bits_Per_Sample bps, UAC_SPK_Channels spk_channels, UAC_MIC_Channels mic_channels) {
#else
USBAudioCard::USBAudioCard(uint32_t sample_rate, UAC_Bits_Per_Sample bps, UAC_SPK_Channels spk_channels, UAC_MIC_Channels mic_channels) {
#endif  // defined(UAC_USE_MULTIPLE_RATES)
  if (_uac == NULL) {
    if ((uint8_t)spk_channels > 2) {
      log_e("Maximum of 2 speaker channels supported!");
      return;
    }
#if defined(UAC_USE_MULTIPLE_RATES)
    if (num_rates == 0 || num_rates > USBAudioCard::UAC_MAX_SAMPLE_RATES) {
      log_e("Invalid number of sample rates %u (1..%u) supported!", num_rates, USBAudioCard::UAC_MAX_SAMPLE_RATES);
      return;
    }
    if (sample_rates == NULL) {
      log_e("sample_rates pointer is NULL!");
      return;
    }
    for (uint8_t i = 0; i < num_rates; i++) {
      // Zero is invalid for a UAC sample frequency. Do not impose a generic non-zero minimum here:
      // the application is responsible for choosing rates supported by its I2S/codec hardware.
      if (sample_rates[i] == 0) {
        log_e("Sample rate at index %u must be greater than zero!", i);
        return;
      }
      // Each advertised rate must be distinct; duplicate UAC ranges add no capability.
      for (uint8_t j = 0; j < i; j++) {
        if (sample_rates[j] == sample_rates[i]) {
          log_e("Duplicate sample rate %" PRIu32 " at index %u!", sample_rates[i], i);
          return;
        }
      }
    }
    _uac = this;
    _num_sample_rates = num_rates;
    _max_sample_rate = 0;
    for (uint8_t i = 0; i < num_rates; i++) {
      _sample_rates[i] = sample_rates[i];
      if (_sample_rates[i] > _max_sample_rate) {
        _max_sample_rate = _sample_rates[i];
      }
    }
    _sample_rate = _sample_rates[0];
#else
    _uac = this;
    _sample_rate = sample_rate;
#endif  // defined(UAC_USE_MULTIPLE_RATES)
    _bits_per_sample = (uint8_t)bps;
    _bytes_per_sample = (_bits_per_sample <= 16) ? 2 : 4;
    _spk_channels = (uint8_t)spk_channels;
    _mic_channels = (uint8_t)mic_channels;

    uint16_t descriptor_len = 0;
#if TUD_OPT_HIGH_SPEED
#ifdef UAC_USE_MULTIPLE_RATES
    if (_max_sample_rate > CFG_TUD_AUDIO_MAX_SAMPLE_RATE) {
#else
    if (_sample_rate > CFG_TUD_AUDIO_MAX_SAMPLE_RATE) {
#endif
      log_e("Maximum %u sample rate supported!", CFG_TUD_AUDIO_MAX_SAMPLE_RATE);
      _uac = NULL;
      return;
    }
    if (_spk_channels == 2 && _mic_channels > 0) {
      // Stereo Headset
      descriptor_len = TUD_AUDIO20_HEADSET_STEREO_DESC_LEN;
    } else if (_spk_channels == 1 && _mic_channels > 0) {
      // Mono Headset
      descriptor_len = TUD_AUDIO20_HEADSET_MONO_DESC_LEN;
    } else if (_spk_channels == 2 && _mic_channels == 0) {
      // Stereo Speaker
      descriptor_len = TUD_AUDIO20_SPEAKER_STEREO_DESC_LEN;
    } else if (_spk_channels == 1 && _mic_channels == 0) {
      // Mono Speaker
      descriptor_len = TUD_AUDIO20_SPEAKER_MONO_DESC_LEN;
    } else if (_spk_channels == 0 && _mic_channels > 0) {
      // Microphone(s)
      descriptor_len = TUD_AUDIO20_MICROPHONE_DESC_LEN;
    }
#else
#ifdef UAC_USE_MULTIPLE_RATES
    if (_max_sample_rate > 48000) {
#else
    if (_sample_rate > 48000) {
#endif  // UAC_USE_MULTIPLE_RATES
      log_e("Maximum 48000 sample rate supported!");
      _uac = NULL;
      return;
    }
    if (((_spk_channels + _mic_channels) * _bytes_per_sample) > 8) {
      log_e("Too many channels or too high bits per sample selected! Audio might not work!");
    }

#ifdef UAC_USE_MULTIPLE_RATES
    if (_spk_channels == 2 && _mic_channels > 0) {
      // Stereo Headset
      descriptor_len = TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(_num_sample_rates);
    } else if (_spk_channels == 1 && _mic_channels > 0) {
      // Mono Headset
      descriptor_len = TUD_AUDIO10_HEADSET_MONO_DESC_LEN(_num_sample_rates);
    } else if (_spk_channels == 2 && _mic_channels == 0) {
      // Stereo Speaker
      descriptor_len = TUD_AUDIO10_SPEAKER_STEREO_DESC_LEN(_num_sample_rates);
    } else if (_spk_channels == 1 && _mic_channels == 0) {
      // Mono Speaker
      descriptor_len = TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(_num_sample_rates);
    } else if (_spk_channels == 0 && _mic_channels > 0) {
      // Microphone(s)
      descriptor_len = TUD_AUDIO10_MICROPHONE_DESC_LEN(_num_sample_rates);
    }
#else
    if (_spk_channels == 2 && _mic_channels > 0) {
      // Stereo Headset
      descriptor_len = TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(1);
    } else if (_spk_channels == 1 && _mic_channels > 0) {
      // Mono Headset
      descriptor_len = TUD_AUDIO10_HEADSET_MONO_DESC_LEN(1);
    } else if (_spk_channels == 2 && _mic_channels == 0) {
      // Stereo Speaker
      descriptor_len = TUD_AUDIO10_SPEAKER_STEREO_DESC_LEN(1);
    } else if (_spk_channels == 1 && _mic_channels == 0) {
      // Mono Speaker
      descriptor_len = TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(1);
    } else if (_spk_channels == 0 && _mic_channels > 0) {
      // Microphone(s)
      descriptor_len = TUD_AUDIO10_MICROPHONE_DESC_LEN(1);
    }
#endif  // UAC_USE_MULTIPLE_RATES
#endif  // TUD_OPT_HIGH_SPEED
    tinyusb_enable_interface(USB_INTERFACE_AUDIO, descriptor_len, tusb_audio_load_descriptor);
  }
}

USBAudioCard::~USBAudioCard() {
  end();
  _uac = NULL;
}

